ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24.h
/* CAN - Register instance definitions */
/* CAN0 */
#define CAN0_MCR                                 CAN_MCR_REG(CAN0)
#define CAN0_CTRL1                               CAN_CTRL1_REG(CAN0)
#define CAN0_TIMER                               CAN_TIMER_REG(CAN0)
#define CAN0_RXMGMASK                            CAN_RXMGMASK_REG(CAN0)
#define CAN0_RX14MASK                            CAN_RX14MASK_REG(CAN0)
#define CAN0_RX15MASK                            CAN_RX15MASK_REG(CAN0)
#define CAN0_ECR                                 CAN_ECR_REG(CAN0)
#define CAN0_ESR1                                CAN_ESR1_REG(CAN0)
#define CAN0_IMASK1                              CAN_IMASK1_REG(CAN0)
#define CAN0_IFLAG1                              CAN_IFLAG1_REG(CAN0)
#define CAN0_CTRL2                               CAN_CTRL2_REG(CAN0)
#define CAN0_ESR2                                CAN_ESR2_REG(CAN0)
#define CAN0_CRCR                                CAN_CRCR_REG(CAN0)
#define CAN0_RXFGMASK                            CAN_RXFGMASK_REG(CAN0)
#define CAN0_RXFIR                               CAN_RXFIR_REG(CAN0)
#define CAN0_CBT                                 CAN_CBT_REG(CAN0)
#define CAN0_CS0                                 CAN_CS_REG(CAN0,0)
#define CAN0_ID0                                 CAN_ID_REG(CAN0,0)
#define CAN0_WORD00                              CAN_WORD0_REG(CAN0,0)
#define CAN0_WORD10                              CAN_WORD1_REG(CAN0,0)
#define CAN0_CS1                                 CAN_CS_REG(CAN0,1)
#define CAN0_ID1                                 CAN_ID_REG(CAN0,1)
#define CAN0_WORD01                              CAN_WORD0_REG(CAN0,1)
#define CAN0_WORD11                              CAN_WORD1_REG(CAN0,1)
#define CAN0_CS2                                 CAN_CS_REG(CAN0,2)
#define CAN0_ID2                                 CAN_ID_REG(CAN0,2)
#define CAN0_WORD02                              CAN_WORD0_REG(CAN0,2)
#define CAN0_WORD12                              CAN_WORD1_REG(CAN0,2)
#define CAN0_CS3                                 CAN_CS_REG(CAN0,3)
#define CAN0_ID3                                 CAN_ID_REG(CAN0,3)
#define CAN0_WORD03                              CAN_WORD0_REG(CAN0,3)
#define CAN0_WORD13                              CAN_WORD1_REG(CAN0,3)
#define CAN0_CS4                                 CAN_CS_REG(CAN0,4)
#define CAN0_ID4                                 CAN_ID_REG(CAN0,4)
#define CAN0_WORD04                              CAN_WORD0_REG(CAN0,4)
#define CAN0_WORD14                              CAN_WORD1_REG(CAN0,4)
#define CAN0_CS5                                 CAN_CS_REG(CAN0,5)
#define CAN0_ID5                                 CAN_ID_REG(CAN0,5)
#define CAN0_WORD05                              CAN_WORD0_REG(CAN0,5)
#define CAN0_WORD15                              CAN_WORD1_REG(CAN0,5)
#define CAN0_CS6                                 CAN_CS_REG(CAN0,6)
#define CAN0_ID6                                 CAN_ID_REG(CAN0,6)
#define CAN0_WORD06                              CAN_WORD0_REG(CAN0,6)
#define CAN0_WORD16                              CAN_WORD1_REG(CAN0,6)
#define CAN0_CS7                                 CAN_CS_REG(CAN0,7)
#define CAN0_ID7                                 CAN_ID_REG(CAN0,7)
#define CAN0_WORD07                              CAN_WORD0_REG(CAN0,7)
#define CAN0_WORD17                              CAN_WORD1_REG(CAN0,7)
#define CAN0_CS8                                 CAN_CS_REG(CAN0,8)
#define CAN0_ID8                                 CAN_ID_REG(CAN0,8)
#define CAN0_WORD08                              CAN_WORD0_REG(CAN0,8)
#define CAN0_WORD18                              CAN_WORD1_REG(CAN0,8)
#define CAN0_CS9                                 CAN_CS_REG(CAN0,9)
#define CAN0_ID9                                 CAN_ID_REG(CAN0,9)
#define CAN0_WORD09                              CAN_WORD0_REG(CAN0,9)
#define CAN0_WORD19                              CAN_WORD1_REG(CAN0,9)
#define CAN0_CS10                                CAN_CS_REG(CAN0,10)
#define CAN0_ID10                                CAN_ID_REG(CAN0,10)
#define CAN0_WORD010                             CAN_WORD0_REG(CAN0,10)
#define CAN0_WORD110                             CAN_WORD1_REG(CAN0,10)
#define CAN0_CS11                                CAN_CS_REG(CAN0,11)
#define CAN0_ID11                                CAN_ID_REG(CAN0,11)
#define CAN0_WORD011                             CAN_WORD0_REG(CAN0,11)
#define CAN0_WORD111                             CAN_WORD1_REG(CAN0,11)
#define CAN0_CS12                                CAN_CS_REG(CAN0,12)
#define CAN0_ID12                                CAN_ID_REG(CAN0,12)
#define CAN0_WORD012                             CAN_WORD0_REG(CAN0,12)
#define CAN0_WORD112                             CAN_WORD1_REG(CAN0,12)
#define CAN0_CS13                                CAN_CS_REG(CAN0,13)
#define CAN0_ID13                                CAN_ID_REG(CAN0,13)
#define CAN0_WORD013                             CAN_WORD0_REG(CAN0,13)
#define CAN0_WORD113                             CAN_WORD1_REG(CAN0,13)
#define CAN0_CS14                                CAN_CS_REG(CAN0,14)
#define CAN0_ID14                                CAN_ID_REG(CAN0,14)
#define CAN0_WORD014                             CAN_WORD0_REG(CAN0,14)
#define CAN0_WORD114                             CAN_WORD1_REG(CAN0,14)
#define CAN0_CS15                                CAN_CS_REG(CAN0,15)
#define CAN0_ID15                                CAN_ID_REG(CAN0,15)
#define CAN0_WORD015                             CAN_WORD0_REG(CAN0,15)
#define CAN0_WORD115                             CAN_WORD1_REG(CAN0,15)
#define CAN0_RXIMR0                              CAN_RXIMR_REG(CAN0,0)
#define CAN0_RXIMR1                              CAN_RXIMR_REG(CAN0,1)
#define CAN0_RXIMR2                              CAN_RXIMR_REG(CAN0,2)
#define CAN0_RXIMR3                              CAN_RXIMR_REG(CAN0,3)
#define CAN0_RXIMR4                              CAN_RXIMR_REG(CAN0,4)
#define CAN0_RXIMR5                              CAN_RXIMR_REG(CAN0,5)
#define CAN0_RXIMR6                              CAN_RXIMR_REG(CAN0,6)
#define CAN0_RXIMR7                              CAN_RXIMR_REG(CAN0,7)
#define CAN0_RXIMR8                              CAN_RXIMR_REG(CAN0,8)
#define CAN0_RXIMR9                              CAN_RXIMR_REG(CAN0,9)
#define CAN0_RXIMR10                             CAN_RXIMR_REG(CAN0,10)
#define CAN0_RXIMR11                             CAN_RXIMR_REG(CAN0,11)
#define CAN0_RXIMR12                             CAN_RXIMR_REG(CAN0,12)
#define CAN0_RXIMR13                             CAN_RXIMR_REG(CAN0,13)
#define CAN0_RXIMR14                             CAN_RXIMR_REG(CAN0,14)
#define CAN0_RXIMR15                             CAN_RXIMR_REG(CAN0,15)
/* CAN1 */
#define CAN1_MCR                                 CAN_MCR_REG(CAN1)
#define CAN1_CTRL1                               CAN_CTRL1_REG(CAN1)
#define CAN1_TIMER                               CAN_TIMER_REG(CAN1)
#define CAN1_RXMGMASK                            CAN_RXMGMASK_REG(CAN1)
#define CAN1_RX14MASK                            CAN_RX14MASK_REG(CAN1)
#define CAN1_RX15MASK                            CAN_RX15MASK_REG(CAN1)
#define CAN1_ECR                                 CAN_ECR_REG(CAN1)
#define CAN1_ESR1                                CAN_ESR1_REG(CAN1)
#define CAN1_IMASK1                              CAN_IMASK1_REG(CAN1)
#define CAN1_IFLAG1                              CAN_IFLAG1_REG(CAN1)
#define CAN1_CTRL2                               CAN_CTRL2_REG(CAN1)
#define CAN1_ESR2                                CAN_ESR2_REG(CAN1)
#define CAN1_CRCR                                CAN_CRCR_REG(CAN1)
#define CAN1_RXFGMASK                            CAN_RXFGMASK_REG(CAN1)
#define CAN1_RXFIR                               CAN_RXFIR_REG(CAN1)
#define CAN1_CBT                                 CAN_CBT_REG(CAN1)
#define CAN1_CS0                                 CAN_CS_REG(CAN1,0)
#define CAN1_ID0                                 CAN_ID_REG(CAN1,0)
#define CAN1_WORD00                              CAN_WORD0_REG(CAN1,0)
#define CAN1_WORD10                              CAN_WORD1_REG(CAN1,0)
#define CAN1_CS1                                 CAN_CS_REG(CAN1,1)
#define CAN1_ID1                                 CAN_ID_REG(CAN1,1)
#define CAN1_WORD01                              CAN_WORD0_REG(CAN1,1)
#define CAN1_WORD11                              CAN_WORD1_REG(CAN1,1)
#define CAN1_CS2                                 CAN_CS_REG(CAN1,2)
#define CAN1_ID2                                 CAN_ID_REG(CAN1,2)
#define CAN1_WORD02                              CAN_WORD0_REG(CAN1,2)
#define CAN1_WORD12                              CAN_WORD1_REG(CAN1,2)
#define CAN1_CS3                                 CAN_CS_REG(CAN1,3)
#define CAN1_ID3                                 CAN_ID_REG(CAN1,3)
#define CAN1_WORD03                              CAN_WORD0_REG(CAN1,3)
#define CAN1_WORD13                              CAN_WORD1_REG(CAN1,3)
#define CAN1_CS4                                 CAN_CS_REG(CAN1,4)
#define CAN1_ID4                                 CAN_ID_REG(CAN1,4)
#define CAN1_WORD04                              CAN_WORD0_REG(CAN1,4)
#define CAN1_WORD14                              CAN_WORD1_REG(CAN1,4)
#define CAN1_CS5                                 CAN_CS_REG(CAN1,5)
#define CAN1_ID5                                 CAN_ID_REG(CAN1,5)
#define CAN1_WORD05                              CAN_WORD0_REG(CAN1,5)
#define CAN1_WORD15                              CAN_WORD1_REG(CAN1,5)
#define CAN1_CS6                                 CAN_CS_REG(CAN1,6)
#define CAN1_ID6                                 CAN_ID_REG(CAN1,6)
#define CAN1_WORD06                              CAN_WORD0_REG(CAN1,6)
#define CAN1_WORD16                              CAN_WORD1_REG(CAN1,6)
#define CAN1_CS7                                 CAN_CS_REG(CAN1,7)
#define CAN1_ID7                                 CAN_ID_REG(CAN1,7)
#define CAN1_WORD07                              CAN_WORD0_REG(CAN1,7)
#define CAN1_WORD17                              CAN_WORD1_REG(CAN1,7)
#define CAN1_CS8                                 CAN_CS_REG(CAN1,8)
#define CAN1_ID8                                 CAN_ID_REG(CAN1,8)
#define CAN1_WORD08                              CAN_WORD0_REG(CAN1,8)
#define CAN1_WORD18                              CAN_WORD1_REG(CAN1,8)
#define CAN1_CS9                                 CAN_CS_REG(CAN1,9)
#define CAN1_ID9                                 CAN_ID_REG(CAN1,9)
#define CAN1_WORD09                              CAN_WORD0_REG(CAN1,9)
#define CAN1_WORD19                              CAN_WORD1_REG(CAN1,9)
#define CAN1_CS10                                CAN_CS_REG(CAN1,10)
#define CAN1_ID10                                CAN_ID_REG(CAN1,10)
#define CAN1_WORD010                             CAN_WORD0_REG(CAN1,10)
#define CAN1_WORD110                             CAN_WORD1_REG(CAN1,10)
#define CAN1_CS11                                CAN_CS_REG(CAN1,11)
#define CAN1_ID11                                CAN_ID_REG(CAN1,11)
#define CAN1_WORD011                             CAN_WORD0_REG(CAN1,11)
#define CAN1_WORD111                             CAN_WORD1_REG(CAN1,11)
#define CAN1_CS12                                CAN_CS_REG(CAN1,12)
#define CAN1_ID12                                CAN_ID_REG(CAN1,12)
#define CAN1_WORD012                             CAN_WORD0_REG(CAN1,12)
#define CAN1_WORD112                             CAN_WORD1_REG(CAN1,12)
#define CAN1_CS13                                CAN_CS_REG(CAN1,13)
#define CAN1_ID13                                CAN_ID_REG(CAN1,13)
#define CAN1_WORD013                             CAN_WORD0_REG(CAN1,13)
#define CAN1_WORD113                             CAN_WORD1_REG(CAN1,13)
#define CAN1_CS14                                CAN_CS_REG(CAN1,14)
#define CAN1_ID14                                CAN_ID_REG(CAN1,14)
#define CAN1_WORD014                             CAN_WORD0_REG(CAN1,14)
#define CAN1_WORD114                             CAN_WORD1_REG(CAN1,14)
#define CAN1_CS15                                CAN_CS_REG(CAN1,15)
#define CAN1_ID15                                CAN_ID_REG(CAN1,15)
#define CAN1_WORD015                             CAN_WORD0_REG(CAN1,15)
#define CAN1_WORD115                             CAN_WORD1_REG(CAN1,15)
#define CAN1_RXIMR0                              CAN_RXIMR_REG(CAN1,0)
#define CAN1_RXIMR1                              CAN_RXIMR_REG(CAN1,1)
#define CAN1_RXIMR2                              CAN_RXIMR_REG(CAN1,2)
#define CAN1_RXIMR3                              CAN_RXIMR_REG(CAN1,3)
#define CAN1_RXIMR4                              CAN_RXIMR_REG(CAN1,4)
#define CAN1_RXIMR5                              CAN_RXIMR_REG(CAN1,5)
#define CAN1_RXIMR6                              CAN_RXIMR_REG(CAN1,6)
#define CAN1_RXIMR7                              CAN_RXIMR_REG(CAN1,7)
#define CAN1_RXIMR8                              CAN_RXIMR_REG(CAN1,8)
#define CAN1_RXIMR9                              CAN_RXIMR_REG(CAN1,9)
#define CAN1_RXIMR10                             CAN_RXIMR_REG(CAN1,10)
#define CAN1_RXIMR11                             CAN_RXIMR_REG(CAN1,11)
#define CAN1_RXIMR12                             CAN_RXIMR_REG(CAN1,12)
#define CAN1_RXIMR13                             CAN_RXIMR_REG(CAN1,13)
#define CAN1_RXIMR14                             CAN_RXIMR_REG(CAN1,14)
#define CAN1_RXIMR15                             CAN_RXIMR_REG(CAN1,15)
/* CAN2 */
#define CAN2_MCR                                 CAN_MCR_REG(CAN2)
#define CAN2_CTRL1                               CAN_CTRL1_REG(CAN2)
#define CAN2_TIMER                               CAN_TIMER_REG(CAN2)
#define CAN2_RXMGMASK                            CAN_RXMGMASK_REG(CAN2)
#define CAN2_RX14MASK                            CAN_RX14MASK_REG(CAN2)
#define CAN2_RX15MASK                            CAN_RX15MASK_REG(CAN2)
#define CAN2_ECR                                 CAN_ECR_REG(CAN2)
#define CAN2_ESR1                                CAN_ESR1_REG(CAN2)
#define CAN2_IMASK1                              CAN_IMASK1_REG(CAN2)
#define CAN2_IFLAG1                              CAN_IFLAG1_REG(CAN2)
#define CAN2_CTRL2                               CAN_CTRL2_REG(CAN2)
#define CAN2_ESR2                                CAN_ESR2_REG(CAN2)
#define CAN2_CRCR                                CAN_CRCR_REG(CAN2)
#define CAN2_RXFGMASK                            CAN_RXFGMASK_REG(CAN2)
#define CAN2_RXFIR                               CAN_RXFIR_REG(CAN2)
#define CAN2_CBT                                 CAN_CBT_REG(CAN2)
#define CAN2_CS0                                 CAN_CS_REG(CAN2,0)
#define CAN2_ID0                                 CAN_ID_REG(CAN2,0)
#define CAN2_WORD00                              CAN_WORD0_REG(CAN2,0)
#define CAN2_WORD10                              CAN_WORD1_REG(CAN2,0)
#define CAN2_CS1                                 CAN_CS_REG(CAN2,1)
#define CAN2_ID1                                 CAN_ID_REG(CAN2,1)
#define CAN2_WORD01                              CAN_WORD0_REG(CAN2,1)
#define CAN2_WORD11                              CAN_WORD1_REG(CAN2,1)
#define CAN2_CS2                                 CAN_CS_REG(CAN2,2)
#define CAN2_ID2                                 CAN_ID_REG(CAN2,2)
#define CAN2_WORD02                              CAN_WORD0_REG(CAN2,2)
#define CAN2_WORD12                              CAN_WORD1_REG(CAN2,2)
#define CAN2_CS3                                 CAN_CS_REG(CAN2,3)
#define CAN2_ID3                                 CAN_ID_REG(CAN2,3)
#define CAN2_WORD03                              CAN_WORD0_REG(CAN2,3)
#define CAN2_WORD13                              CAN_WORD1_REG(CAN2,3)
#define CAN2_CS4                                 CAN_CS_REG(CAN2,4)
#define CAN2_ID4                                 CAN_ID_REG(CAN2,4)
#define CAN2_WORD04                              CAN_WORD0_REG(CAN2,4)
#define CAN2_WORD14                              CAN_WORD1_REG(CAN2,4)
#define CAN2_CS5                                 CAN_CS_REG(CAN2,5)
#define CAN2_ID5                                 CAN_ID_REG(CAN2,5)
#define CAN2_WORD05                              CAN_WORD0_REG(CAN2,5)
#define CAN2_WORD15                              CAN_WORD1_REG(CAN2,5)
#define CAN2_CS6                                 CAN_CS_REG(CAN2,6)
#define CAN2_ID6                                 CAN_ID_REG(CAN2,6)
#define CAN2_WORD06                              CAN_WORD0_REG(CAN2,6)
#define CAN2_WORD16                              CAN_WORD1_REG(CAN2,6)
#define CAN2_CS7                                 CAN_CS_REG(CAN2,7)
#define CAN2_ID7                                 CAN_ID_REG(CAN2,7)
#define CAN2_WORD07                              CAN_WORD0_REG(CAN2,7)
#define CAN2_WORD17                              CAN_WORD1_REG(CAN2,7)
#define CAN2_CS8                                 CAN_CS_REG(CAN2,8)
#define CAN2_ID8                                 CAN_ID_REG(CAN2,8)
#define CAN2_WORD08                              CAN_WORD0_REG(CAN2,8)
#define CAN2_WORD18                              CAN_WORD1_REG(CAN2,8)
#define CAN2_CS9                                 CAN_CS_REG(CAN2,9)
#define CAN2_ID9                                 CAN_ID_REG(CAN2,9)
#define CAN2_WORD09                              CAN_WORD0_REG(CAN2,9)
#define CAN2_WORD19                              CAN_WORD1_REG(CAN2,9)
#define CAN2_CS10                                CAN_CS_REG(CAN2,10)
#define CAN2_ID10                                CAN_ID_REG(CAN2,10)
#define CAN2_WORD010                             CAN_WORD0_REG(CAN2,10)
#define CAN2_WORD110                             CAN_WORD1_REG(CAN2,10)
#define CAN2_CS11                                CAN_CS_REG(CAN2,11)
#define CAN2_ID11                                CAN_ID_REG(CAN2,11)
#define CAN2_WORD011                             CAN_WORD0_REG(CAN2,11)
#define CAN2_WORD111                             CAN_WORD1_REG(CAN2,11)
#define CAN2_CS12                                CAN_CS_REG(CAN2,12)
#define CAN2_ID12                                CAN_ID_REG(CAN2,12)
#define CAN2_WORD012                             CAN_WORD0_REG(CAN2,12)
#define CAN2_WORD112                             CAN_WORD1_REG(CAN2,12)
#define CAN2_CS13                                CAN_CS_REG(CAN2,13)
#define CAN2_ID13                                CAN_ID_REG(CAN2,13)
#define CAN2_WORD013                             CAN_WORD0_REG(CAN2,13)
#define CAN2_WORD113                             CAN_WORD1_REG(CAN2,13)
#define CAN2_CS14                                CAN_CS_REG(CAN2,14)
#define CAN2_ID14                                CAN_ID_REG(CAN2,14)
#define CAN2_WORD014                             CAN_WORD0_REG(CAN2,14)
#define CAN2_WORD114                             CAN_WORD1_REG(CAN2,14)
#define CAN2_CS15                                CAN_CS_REG(CAN2,15)
#define CAN2_ID15                                CAN_ID_REG(CAN2,15)
#define CAN2_WORD015                             CAN_WORD0_REG(CAN2,15)
#define CAN2_WORD115                             CAN_WORD1_REG(CAN2,15)
#define CAN2_RXIMR0                              CAN_RXIMR_REG(CAN2,0)
#define CAN2_RXIMR1                              CAN_RXIMR_REG(CAN2,1)
#define CAN2_RXIMR2                              CAN_RXIMR_REG(CAN2,2)
#define CAN2_RXIMR3                              CAN_RXIMR_REG(CAN2,3)
#define CAN2_RXIMR4                              CAN_RXIMR_REG(CAN2,4)
#define CAN2_RXIMR5                              CAN_RXIMR_REG(CAN2,5)
#define CAN2_RXIMR6                              CAN_RXIMR_REG(CAN2,6)
#define CAN2_RXIMR7                              CAN_RXIMR_REG(CAN2,7)
#define CAN2_RXIMR8                              CAN_RXIMR_REG(CAN2,8)
#define CAN2_RXIMR9                              CAN_RXIMR_REG(CAN2,9)
#define CAN2_RXIMR10                             CAN_RXIMR_REG(CAN2,10)
#define CAN2_RXIMR11                             CAN_RXIMR_REG(CAN2,11)
#define CAN2_RXIMR12                             CAN_RXIMR_REG(CAN2,12)
#define CAN2_RXIMR13                             CAN_RXIMR_REG(CAN2,13)
#define CAN2_RXIMR14                             CAN_RXIMR_REG(CAN2,14)
#define CAN2_RXIMR15                             CAN_RXIMR_REG(CAN2,15)

