ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24.h
/* PWR Bit Fields */
#define HSADC_PWR_PDA_MASK                       0x1u
#define HSADC_PWR_PDA_SHIFT                      0
#define HSADC_PWR_PDA_WIDTH                      1
#define HSADC_PWR_PDA(x)                         (((uint16_t)(((uint16_t)(x))<<HSADC_PWR_PDA_SHIFT))&HSADC_PWR_PDA_MASK)
#define HSADC_PWR_PDB_MASK                       0x2u
#define HSADC_PWR_PDB_SHIFT                      1
#define HSADC_PWR_PDB_WIDTH                      1
#define HSADC_PWR_PDB(x)                         (((uint16_t)(((uint16_t)(x))<<HSADC_PWR_PDB_SHIFT))&HSADC_PWR_PDB_MASK)
#define HSADC_PWR_APD_MASK                       0x8u
#define HSADC_PWR_APD_SHIFT                      3
#define HSADC_PWR_APD_WIDTH                      1
#define HSADC_PWR_APD(x)                         (((uint16_t)(((uint16_t)(x))<<HSADC_PWR_APD_SHIFT))&HSADC_PWR_APD_MASK)
#define HSADC_PWR_PUDELAY_MASK                   0x3F0u
#define HSADC_PWR_PUDELAY_SHIFT                  4
#define HSADC_PWR_PUDELAY_WIDTH                  6
#define HSADC_PWR_PUDELAY(x)                     (((uint16_t)(((uint16_t)(x))<<HSADC_PWR_PUDELAY_SHIFT))&HSADC_PWR_PUDELAY_MASK)
#define HSADC_PWR_PSTSA_MASK                     0x400u
#define HSADC_PWR_PSTSA_SHIFT                    10
#define HSADC_PWR_PSTSA_WIDTH                    1
#define HSADC_PWR_PSTSA(x)                       (((uint16_t)(((uint16_t)(x))<<HSADC_PWR_PSTSA_SHIFT))&HSADC_PWR_PSTSA_MASK)
#define HSADC_PWR_PSTSB_MASK                     0x800u
#define HSADC_PWR_PSTSB_SHIFT                    11
#define HSADC_PWR_PSTSB_WIDTH                    1
#define HSADC_PWR_PSTSB(x)                       (((uint16_t)(((uint16_t)(x))<<HSADC_PWR_PSTSB_SHIFT))&HSADC_PWR_PSTSB_MASK)
#define HSADC_PWR_ASB_MASK                       0x8000u
#define HSADC_PWR_ASB_SHIFT                      15
#define HSADC_PWR_ASB_WIDTH                      1
#define HSADC_PWR_ASB(x)                         (((uint16_t)(((uint16_t)(x))<<HSADC_PWR_ASB_SHIFT))&HSADC_PWR_ASB_MASK)
/* SCTRL Bit Fields */
#define HSADC_SCTRL_SC_MASK                      0xFFFFu
#define HSADC_SCTRL_SC_SHIFT                     0
#define HSADC_SCTRL_SC_WIDTH                     16
#define HSADC_SCTRL_SC(x)                        (((uint16_t)(((uint16_t)(x))<<HSADC_SCTRL_SC_SHIFT))&HSADC_SCTRL_SC_MASK)
/* PWR2 Bit Fields */
#define HSADC_PWR2_DIVB_MASK                     0x3F00u
#define HSADC_PWR2_DIVB_SHIFT                    8
#define HSADC_PWR2_DIVB_WIDTH                    6
#define HSADC_PWR2_DIVB(x)                       (((uint16_t)(((uint16_t)(x))<<HSADC_PWR2_DIVB_SHIFT))&HSADC_PWR2_DIVB_MASK)
/* CTRL3 Bit Fields */
#define HSADC_CTRL3_DMASRC_MASK                  0x40u
#define HSADC_CTRL3_DMASRC_SHIFT                 6
#define HSADC_CTRL3_DMASRC_WIDTH                 1
#define HSADC_CTRL3_DMASRC(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL3_DMASRC_SHIFT))&HSADC_CTRL3_DMASRC_MASK)
#define HSADC_CTRL3_ADCRES_MASK                  0x300u
#define HSADC_CTRL3_ADCRES_SHIFT                 8
#define HSADC_CTRL3_ADCRES_WIDTH                 2
#define HSADC_CTRL3_ADCRES(x)                    (((uint16_t)(((uint16_t)(x))<<HSADC_CTRL3_ADCRES_SHIFT))&HSADC_CTRL3_ADCRES_MASK)
/* SCINTEN Bit Fields */
#define HSADC_SCINTEN_SCINTEN_MASK               0xFFFFu
#define HSADC_SCINTEN_SCINTEN_SHIFT              0
#define HSADC_SCINTEN_SCINTEN_WIDTH              16
#define HSADC_SCINTEN_SCINTEN(x)                 (((uint16_t)(((uint16_t)(x))<<HSADC_SCINTEN_SCINTEN_SHIFT))&HSADC_SCINTEN_SCINTEN_MASK)
/* SAMPTIM Bit Fields */
#define HSADC_SAMPTIM_SAMPT_A_MASK               0xFFu
#define HSADC_SAMPTIM_SAMPT_A_SHIFT              0
#define HSADC_SAMPTIM_SAMPT_A_WIDTH              8
#define HSADC_SAMPTIM_SAMPT_A(x)                 (((uint16_t)(((uint16_t)(x))<<HSADC_SAMPTIM_SAMPT_A_SHIFT))&HSADC_SAMPTIM_SAMPT_A_MASK)
#define HSADC_SAMPTIM_SAMPT_B_MASK               0xFF00u
#define HSADC_SAMPTIM_SAMPT_B_SHIFT              8
#define HSADC_SAMPTIM_SAMPT_B_WIDTH              8
#define HSADC_SAMPTIM_SAMPT_B(x)                 (((uint16_t)(((uint16_t)(x))<<HSADC_SAMPTIM_SAMPT_B_SHIFT))&HSADC_SAMPTIM_SAMPT_B_MASK)
/* CALIB Bit Fields */
#define HSADC_CALIB_REQSINGA_MASK                0x1u
#define HSADC_CALIB_REQSINGA_SHIFT               0
#define HSADC_CALIB_REQSINGA_WIDTH               1
#define HSADC_CALIB_REQSINGA(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CALIB_REQSINGA_SHIFT))&HSADC_CALIB_REQSINGA_MASK)
#define HSADC_CALIB_REQDIFA_MASK                 0x2u
#define HSADC_CALIB_REQDIFA_SHIFT                1
#define HSADC_CALIB_REQDIFA_WIDTH                1
#define HSADC_CALIB_REQDIFA(x)                   (((uint16_t)(((uint16_t)(x))<<HSADC_CALIB_REQDIFA_SHIFT))&HSADC_CALIB_REQDIFA_MASK)
#define HSADC_CALIB_BYPA_MASK                    0x4u
#define HSADC_CALIB_BYPA_SHIFT                   2
#define HSADC_CALIB_BYPA_WIDTH                   1
#define HSADC_CALIB_BYPA(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_CALIB_BYPA_SHIFT))&HSADC_CALIB_BYPA_MASK)
#define HSADC_CALIB_CAL_REQA_MASK                0x8u
#define HSADC_CALIB_CAL_REQA_SHIFT               3
#define HSADC_CALIB_CAL_REQA_WIDTH               1
#define HSADC_CALIB_CAL_REQA(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CALIB_CAL_REQA_SHIFT))&HSADC_CALIB_CAL_REQA_MASK)
#define HSADC_CALIB_REQSINGB_MASK                0x10u
#define HSADC_CALIB_REQSINGB_SHIFT               4
#define HSADC_CALIB_REQSINGB_WIDTH               1
#define HSADC_CALIB_REQSINGB(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CALIB_REQSINGB_SHIFT))&HSADC_CALIB_REQSINGB_MASK)
#define HSADC_CALIB_REQDIFB_MASK                 0x20u
#define HSADC_CALIB_REQDIFB_SHIFT                5
#define HSADC_CALIB_REQDIFB_WIDTH                1
#define HSADC_CALIB_REQDIFB(x)                   (((uint16_t)(((uint16_t)(x))<<HSADC_CALIB_REQDIFB_SHIFT))&HSADC_CALIB_REQDIFB_MASK)
#define HSADC_CALIB_BYPB_MASK                    0x40u
#define HSADC_CALIB_BYPB_SHIFT                   6
#define HSADC_CALIB_BYPB_WIDTH                   1
#define HSADC_CALIB_BYPB(x)                      (((uint16_t)(((uint16_t)(x))<<HSADC_CALIB_BYPB_SHIFT))&HSADC_CALIB_BYPB_MASK)
#define HSADC_CALIB_CAL_REQB_MASK                0x80u
#define HSADC_CALIB_CAL_REQB_SHIFT               7
#define HSADC_CALIB_CAL_REQB_WIDTH               1
#define HSADC_CALIB_CAL_REQB(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CALIB_CAL_REQB_SHIFT))&HSADC_CALIB_CAL_REQB_MASK)
#define HSADC_CALIB_EOCALIEA_MASK                0x100u
#define HSADC_CALIB_EOCALIEA_SHIFT               8
#define HSADC_CALIB_EOCALIEA_WIDTH               1
#define HSADC_CALIB_EOCALIEA(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CALIB_EOCALIEA_SHIFT))&HSADC_CALIB_EOCALIEA_MASK)
#define HSADC_CALIB_EOCALIEB_MASK                0x200u
#define HSADC_CALIB_EOCALIEB_SHIFT               9
#define HSADC_CALIB_EOCALIEB_WIDTH               1
#define HSADC_CALIB_EOCALIEB(x)                  (((uint16_t)(((uint16_t)(x))<<HSADC_CALIB_EOCALIEB_SHIFT))&HSADC_CALIB_EOCALIEB_MASK)
/* CALVAL_A Bit Fields */
#define HSADC_CALVAL_A_CALVSING_MASK             0x7Fu
#define HSADC_CALVAL_A_CALVSING_SHIFT            0
#define HSADC_CALVAL_A_CALVSING_WIDTH            7
#define HSADC_CALVAL_A_CALVSING(x)               (((uint16_t)(((uint16_t)(x))<<HSADC_CALVAL_A_CALVSING_SHIFT))&HSADC_CALVAL_A_CALVSING_MASK)
#define HSADC_CALVAL_A_CALVDIF_MASK              0x7F00u
#define HSADC_CALVAL_A_CALVDIF_SHIFT             8
#define HSADC_CALVAL_A_CALVDIF_WIDTH             7
#define HSADC_CALVAL_A_CALVDIF(x)                (((uint16_t)(((uint16_t)(x))<<HSADC_CALVAL_A_CALVDIF_SHIFT))&HSADC_CALVAL_A_CALVDIF_MASK)
/* CALVAL_B Bit Fields */
#define HSADC_CALVAL_B_CALVSING_MASK             0x7Fu
#define HSADC_CALVAL_B_CALVSING_SHIFT            0
#define HSADC_CALVAL_B_CALVSING_WIDTH            7
#define HSADC_CALVAL_B_CALVSING(x)               (((uint16_t)(((uint16_t)(x))<<HSADC_CALVAL_B_CALVSING_SHIFT))&HSADC_CALVAL_B_CALVSING_MASK)
#define HSADC_CALVAL_B_CALVDIF_MASK              0x7F00u
#define HSADC_CALVAL_B_CALVDIF_SHIFT             8
#define HSADC_CALVAL_B_CALVDIF_WIDTH             7
#define HSADC_CALVAL_B_CALVDIF(x)                (((uint16_t)(((uint16_t)(x))<<HSADC_CALVAL_B_CALVDIF_SHIFT))&HSADC_CALVAL_B_CALVDIF_MASK)
/* MUX67_SEL Bit Fields */
#define HSADC_MUX67_SEL_CH6_SELA_MASK            0x7u
#define HSADC_MUX67_SEL_CH6_SELA_SHIFT           0
#define HSADC_MUX67_SEL_CH6_SELA_WIDTH           3
#define HSADC_MUX67_SEL_CH6_SELA(x)              (((uint16_t)(((uint16_t)(x))<<HSADC_MUX67_SEL_CH6_SELA_SHIFT))&HSADC_MUX67_SEL_CH6_SELA_MASK)
#define HSADC_MUX67_SEL_CH7_SELA_MASK            0x70u
#define HSADC_MUX67_SEL_CH7_SELA_SHIFT           4
#define HSADC_MUX67_SEL_CH7_SELA_WIDTH           3
#define HSADC_MUX67_SEL_CH7_SELA(x)              (((uint16_t)(((uint16_t)(x))<<HSADC_MUX67_SEL_CH7_SELA_SHIFT))&HSADC_MUX67_SEL_CH7_SELA_MASK)
#define HSADC_MUX67_SEL_CH6_SELB_MASK            0x700u
#define HSADC_MUX67_SEL_CH6_SELB_SHIFT           8
#define HSADC_MUX67_SEL_CH6_SELB_WIDTH           3
#define HSADC_MUX67_SEL_CH6_SELB(x)              (((uint16_t)(((uint16_t)(x))<<HSADC_MUX67_SEL_CH6_SELB_SHIFT))&HSADC_MUX67_SEL_CH6_SELB_MASK)
#define HSADC_MUX67_SEL_CH7_SELB_MASK            0x7000u
#define HSADC_MUX67_SEL_CH7_SELB_SHIFT           12
#define HSADC_MUX67_SEL_CH7_SELB_WIDTH           3
#define HSADC_MUX67_SEL_CH7_SELB(x)              (((uint16_t)(((uint16_t)(x))<<HSADC_MUX67_SEL_CH7_SELB_SHIFT))&HSADC_MUX67_SEL_CH7_SELB_MASK)

/*!
 * @}
 */ /* end of group HSADC_Register_Masks */


