ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24.h
/* CNT Bit Fields */
#define PWM_CNT_CNT_MASK                         0xFFFFu
#define PWM_CNT_CNT_SHIFT                        0
#define PWM_CNT_CNT_WIDTH                        16
#define PWM_CNT_CNT(x)                           (((uint16_t)(((uint16_t)(x))<<PWM_CNT_CNT_SHIFT))&PWM_CNT_CNT_MASK)
/* INIT Bit Fields */
#define PWM_INIT_INIT_MASK                       0xFFFFu
#define PWM_INIT_INIT_SHIFT                      0
#define PWM_INIT_INIT_WIDTH                      16
#define PWM_INIT_INIT(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_INIT_INIT_SHIFT))&PWM_INIT_INIT_MASK)
/* CTRL2 Bit Fields */
#define PWM_CTRL2_CLK_SEL_MASK                   0x3u
#define PWM_CTRL2_CLK_SEL_SHIFT                  0
#define PWM_CTRL2_CLK_SEL_WIDTH                  2
#define PWM_CTRL2_CLK_SEL(x)                     (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_CLK_SEL_SHIFT))&PWM_CTRL2_CLK_SEL_MASK)
#define PWM_CTRL2_RELOAD_SEL_MASK                0x4u
#define PWM_CTRL2_RELOAD_SEL_SHIFT               2
#define PWM_CTRL2_RELOAD_SEL_WIDTH               1
#define PWM_CTRL2_RELOAD_SEL(x)                  (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_RELOAD_SEL_SHIFT))&PWM_CTRL2_RELOAD_SEL_MASK)
#define PWM_CTRL2_FORCE_SEL_MASK                 0x38u
#define PWM_CTRL2_FORCE_SEL_SHIFT                3
#define PWM_CTRL2_FORCE_SEL_WIDTH                3
#define PWM_CTRL2_FORCE_SEL(x)                   (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_FORCE_SEL_SHIFT))&PWM_CTRL2_FORCE_SEL_MASK)
#define PWM_CTRL2_FORCE_MASK                     0x40u
#define PWM_CTRL2_FORCE_SHIFT                    6
#define PWM_CTRL2_FORCE_WIDTH                    1
#define PWM_CTRL2_FORCE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_FORCE_SHIFT))&PWM_CTRL2_FORCE_MASK)
#define PWM_CTRL2_FRCEN_MASK                     0x80u
#define PWM_CTRL2_FRCEN_SHIFT                    7
#define PWM_CTRL2_FRCEN_WIDTH                    1
#define PWM_CTRL2_FRCEN(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_FRCEN_SHIFT))&PWM_CTRL2_FRCEN_MASK)
#define PWM_CTRL2_INIT_SEL_MASK                  0x300u
#define PWM_CTRL2_INIT_SEL_SHIFT                 8
#define PWM_CTRL2_INIT_SEL_WIDTH                 2
#define PWM_CTRL2_INIT_SEL(x)                    (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_INIT_SEL_SHIFT))&PWM_CTRL2_INIT_SEL_MASK)
#define PWM_CTRL2_PWMX_INIT_MASK                 0x400u
#define PWM_CTRL2_PWMX_INIT_SHIFT                10
#define PWM_CTRL2_PWMX_INIT_WIDTH                1
#define PWM_CTRL2_PWMX_INIT(x)                   (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_PWMX_INIT_SHIFT))&PWM_CTRL2_PWMX_INIT_MASK)
#define PWM_CTRL2_PWM45_INIT_MASK                0x800u
#define PWM_CTRL2_PWM45_INIT_SHIFT               11
#define PWM_CTRL2_PWM45_INIT_WIDTH               1
#define PWM_CTRL2_PWM45_INIT(x)                  (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_PWM45_INIT_SHIFT))&PWM_CTRL2_PWM45_INIT_MASK)
#define PWM_CTRL2_PWM23_INIT_MASK                0x1000u
#define PWM_CTRL2_PWM23_INIT_SHIFT               12
#define PWM_CTRL2_PWM23_INIT_WIDTH               1
#define PWM_CTRL2_PWM23_INIT(x)                  (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_PWM23_INIT_SHIFT))&PWM_CTRL2_PWM23_INIT_MASK)
#define PWM_CTRL2_INDEP_MASK                     0x2000u
#define PWM_CTRL2_INDEP_SHIFT                    13
#define PWM_CTRL2_INDEP_WIDTH                    1
#define PWM_CTRL2_INDEP(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_INDEP_SHIFT))&PWM_CTRL2_INDEP_MASK)
#define PWM_CTRL2_WAITEN_MASK                    0x4000u
#define PWM_CTRL2_WAITEN_SHIFT                   14
#define PWM_CTRL2_WAITEN_WIDTH                   1
#define PWM_CTRL2_WAITEN(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_WAITEN_SHIFT))&PWM_CTRL2_WAITEN_MASK)
#define PWM_CTRL2_DBGEN_MASK                     0x8000u
#define PWM_CTRL2_DBGEN_SHIFT                    15
#define PWM_CTRL2_DBGEN_WIDTH                    1
#define PWM_CTRL2_DBGEN(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_CTRL2_DBGEN_SHIFT))&PWM_CTRL2_DBGEN_MASK)
/* CTRL Bit Fields */
#define PWM_CTRL_DBLEN_MASK                      0x1u
#define PWM_CTRL_DBLEN_SHIFT                     0
#define PWM_CTRL_DBLEN_WIDTH                     1
#define PWM_CTRL_DBLEN(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_CTRL_DBLEN_SHIFT))&PWM_CTRL_DBLEN_MASK)
#define PWM_CTRL_DBLX_MASK                       0x2u
#define PWM_CTRL_DBLX_SHIFT                      1
#define PWM_CTRL_DBLX_WIDTH                      1
#define PWM_CTRL_DBLX(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_CTRL_DBLX_SHIFT))&PWM_CTRL_DBLX_MASK)
#define PWM_CTRL_LDMOD_MASK                      0x4u
#define PWM_CTRL_LDMOD_SHIFT                     2
#define PWM_CTRL_LDMOD_WIDTH                     1
#define PWM_CTRL_LDMOD(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_CTRL_LDMOD_SHIFT))&PWM_CTRL_LDMOD_MASK)
#define PWM_CTRL_PRSC_MASK                       0x70u
#define PWM_CTRL_PRSC_SHIFT                      4
#define PWM_CTRL_PRSC_WIDTH                      3
#define PWM_CTRL_PRSC(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_CTRL_PRSC_SHIFT))&PWM_CTRL_PRSC_MASK)
#define PWM_CTRL_DT_MASK                         0x300u
#define PWM_CTRL_DT_SHIFT                        8
#define PWM_CTRL_DT_WIDTH                        2
#define PWM_CTRL_DT(x)                           (((uint16_t)(((uint16_t)(x))<<PWM_CTRL_DT_SHIFT))&PWM_CTRL_DT_MASK)
#define PWM_CTRL_FULL_MASK                       0x400u
#define PWM_CTRL_FULL_SHIFT                      10
#define PWM_CTRL_FULL_WIDTH                      1
#define PWM_CTRL_FULL(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_CTRL_FULL_SHIFT))&PWM_CTRL_FULL_MASK)
#define PWM_CTRL_HALF_MASK                       0x800u
#define PWM_CTRL_HALF_SHIFT                      11
#define PWM_CTRL_HALF_WIDTH                      1
#define PWM_CTRL_HALF(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_CTRL_HALF_SHIFT))&PWM_CTRL_HALF_MASK)
#define PWM_CTRL_LDFQ_MASK                       0xF000u
#define PWM_CTRL_LDFQ_SHIFT                      12
#define PWM_CTRL_LDFQ_WIDTH                      4
#define PWM_CTRL_LDFQ(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_CTRL_LDFQ_SHIFT))&PWM_CTRL_LDFQ_MASK)
/* VAL0 Bit Fields */
#define PWM_VAL0_VAL0_MASK                       0xFFFFu
#define PWM_VAL0_VAL0_SHIFT                      0
#define PWM_VAL0_VAL0_WIDTH                      16
#define PWM_VAL0_VAL0(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_VAL0_VAL0_SHIFT))&PWM_VAL0_VAL0_MASK)
/* FRACVAL1 Bit Fields */
#define PWM_FRACVAL1_FRACVAL1_MASK               0xF800u
#define PWM_FRACVAL1_FRACVAL1_SHIFT              11
#define PWM_FRACVAL1_FRACVAL1_WIDTH              5
#define PWM_FRACVAL1_FRACVAL1(x)                 (((uint16_t)(((uint16_t)(x))<<PWM_FRACVAL1_FRACVAL1_SHIFT))&PWM_FRACVAL1_FRACVAL1_MASK)
/* VAL1 Bit Fields */
#define PWM_VAL1_VAL1_MASK                       0xFFFFu
#define PWM_VAL1_VAL1_SHIFT                      0
#define PWM_VAL1_VAL1_WIDTH                      16
#define PWM_VAL1_VAL1(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_VAL1_VAL1_SHIFT))&PWM_VAL1_VAL1_MASK)
/* FRACVAL2 Bit Fields */
#define PWM_FRACVAL2_FRACVAL2_MASK               0xF800u
#define PWM_FRACVAL2_FRACVAL2_SHIFT              11
#define PWM_FRACVAL2_FRACVAL2_WIDTH              5
#define PWM_FRACVAL2_FRACVAL2(x)                 (((uint16_t)(((uint16_t)(x))<<PWM_FRACVAL2_FRACVAL2_SHIFT))&PWM_FRACVAL2_FRACVAL2_MASK)
/* VAL2 Bit Fields */
#define PWM_VAL2_VAL2_MASK                       0xFFFFu
#define PWM_VAL2_VAL2_SHIFT                      0
#define PWM_VAL2_VAL2_WIDTH                      16
#define PWM_VAL2_VAL2(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_VAL2_VAL2_SHIFT))&PWM_VAL2_VAL2_MASK)
/* FRACVAL3 Bit Fields */
#define PWM_FRACVAL3_FRACVAL3_MASK               0xF800u
#define PWM_FRACVAL3_FRACVAL3_SHIFT              11
#define PWM_FRACVAL3_FRACVAL3_WIDTH              5
#define PWM_FRACVAL3_FRACVAL3(x)                 (((uint16_t)(((uint16_t)(x))<<PWM_FRACVAL3_FRACVAL3_SHIFT))&PWM_FRACVAL3_FRACVAL3_MASK)
/* VAL3 Bit Fields */
#define PWM_VAL3_VAL3_MASK                       0xFFFFu
#define PWM_VAL3_VAL3_SHIFT                      0
#define PWM_VAL3_VAL3_WIDTH                      16
#define PWM_VAL3_VAL3(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_VAL3_VAL3_SHIFT))&PWM_VAL3_VAL3_MASK)
/* FRACVAL4 Bit Fields */
#define PWM_FRACVAL4_FRACVAL4_MASK               0xF800u
#define PWM_FRACVAL4_FRACVAL4_SHIFT              11
#define PWM_FRACVAL4_FRACVAL4_WIDTH              5
#define PWM_FRACVAL4_FRACVAL4(x)                 (((uint16_t)(((uint16_t)(x))<<PWM_FRACVAL4_FRACVAL4_SHIFT))&PWM_FRACVAL4_FRACVAL4_MASK)
/* VAL4 Bit Fields */
#define PWM_VAL4_VAL4_MASK                       0xFFFFu
#define PWM_VAL4_VAL4_SHIFT                      0
#define PWM_VAL4_VAL4_WIDTH                      16
#define PWM_VAL4_VAL4(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_VAL4_VAL4_SHIFT))&PWM_VAL4_VAL4_MASK)
/* FRACVAL5 Bit Fields */
#define PWM_FRACVAL5_FRACVAL5_MASK               0xF800u
#define PWM_FRACVAL5_FRACVAL5_SHIFT              11
#define PWM_FRACVAL5_FRACVAL5_WIDTH              5
#define PWM_FRACVAL5_FRACVAL5(x)                 (((uint16_t)(((uint16_t)(x))<<PWM_FRACVAL5_FRACVAL5_SHIFT))&PWM_FRACVAL5_FRACVAL5_MASK)
/* VAL5 Bit Fields */
#define PWM_VAL5_VAL5_MASK                       0xFFFFu
#define PWM_VAL5_VAL5_SHIFT                      0
#define PWM_VAL5_VAL5_WIDTH                      16
#define PWM_VAL5_VAL5(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_VAL5_VAL5_SHIFT))&PWM_VAL5_VAL5_MASK)
/* FRCTRL Bit Fields */
#define PWM_FRCTRL_FRAC1_EN_MASK                 0x2u
#define PWM_FRCTRL_FRAC1_EN_SHIFT                1
#define PWM_FRCTRL_FRAC1_EN_WIDTH                1
#define PWM_FRCTRL_FRAC1_EN(x)                   (((uint16_t)(((uint16_t)(x))<<PWM_FRCTRL_FRAC1_EN_SHIFT))&PWM_FRCTRL_FRAC1_EN_MASK)
#define PWM_FRCTRL_FRAC23_EN_MASK                0x4u
#define PWM_FRCTRL_FRAC23_EN_SHIFT               2
#define PWM_FRCTRL_FRAC23_EN_WIDTH               1
#define PWM_FRCTRL_FRAC23_EN(x)                  (((uint16_t)(((uint16_t)(x))<<PWM_FRCTRL_FRAC23_EN_SHIFT))&PWM_FRCTRL_FRAC23_EN_MASK)
#define PWM_FRCTRL_FRAC45_EN_MASK                0x10u
#define PWM_FRCTRL_FRAC45_EN_SHIFT               4
#define PWM_FRCTRL_FRAC45_EN_WIDTH               1
#define PWM_FRCTRL_FRAC45_EN(x)                  (((uint16_t)(((uint16_t)(x))<<PWM_FRCTRL_FRAC45_EN_SHIFT))&PWM_FRCTRL_FRAC45_EN_MASK)
#define PWM_FRCTRL_FRAC_PU_MASK                  0x100u
#define PWM_FRCTRL_FRAC_PU_SHIFT                 8
#define PWM_FRCTRL_FRAC_PU_WIDTH                 1
#define PWM_FRCTRL_FRAC_PU(x)                    (((uint16_t)(((uint16_t)(x))<<PWM_FRCTRL_FRAC_PU_SHIFT))&PWM_FRCTRL_FRAC_PU_MASK)
#define PWM_FRCTRL_TEST_MASK                     0x8000u
#define PWM_FRCTRL_TEST_SHIFT                    15
#define PWM_FRCTRL_TEST_WIDTH                    1
#define PWM_FRCTRL_TEST(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_FRCTRL_TEST_SHIFT))&PWM_FRCTRL_TEST_MASK)
/* OCTRL Bit Fields */
#define PWM_OCTRL_PWMXFS_MASK                    0x3u
#define PWM_OCTRL_PWMXFS_SHIFT                   0
#define PWM_OCTRL_PWMXFS_WIDTH                   2
#define PWM_OCTRL_PWMXFS(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_OCTRL_PWMXFS_SHIFT))&PWM_OCTRL_PWMXFS_MASK)
#define PWM_OCTRL_PWMBFS_MASK                    0xCu
#define PWM_OCTRL_PWMBFS_SHIFT                   2
#define PWM_OCTRL_PWMBFS_WIDTH                   2
#define PWM_OCTRL_PWMBFS(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_OCTRL_PWMBFS_SHIFT))&PWM_OCTRL_PWMBFS_MASK)
#define PWM_OCTRL_PWMAFS_MASK                    0x30u
#define PWM_OCTRL_PWMAFS_SHIFT                   4
#define PWM_OCTRL_PWMAFS_WIDTH                   2
#define PWM_OCTRL_PWMAFS(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_OCTRL_PWMAFS_SHIFT))&PWM_OCTRL_PWMAFS_MASK)
#define PWM_OCTRL_POLX_MASK                      0x100u
#define PWM_OCTRL_POLX_SHIFT                     8
#define PWM_OCTRL_POLX_WIDTH                     1
#define PWM_OCTRL_POLX(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_OCTRL_POLX_SHIFT))&PWM_OCTRL_POLX_MASK)
#define PWM_OCTRL_POLB_MASK                      0x200u
#define PWM_OCTRL_POLB_SHIFT                     9
#define PWM_OCTRL_POLB_WIDTH                     1
#define PWM_OCTRL_POLB(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_OCTRL_POLB_SHIFT))&PWM_OCTRL_POLB_MASK)
#define PWM_OCTRL_POLA_MASK                      0x400u
#define PWM_OCTRL_POLA_SHIFT                     10
#define PWM_OCTRL_POLA_WIDTH                     1
#define PWM_OCTRL_POLA(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_OCTRL_POLA_SHIFT))&PWM_OCTRL_POLA_MASK)
#define PWM_OCTRL_PWMX_IN_MASK                   0x2000u
#define PWM_OCTRL_PWMX_IN_SHIFT                  13
#define PWM_OCTRL_PWMX_IN_WIDTH                  1
#define PWM_OCTRL_PWMX_IN(x)                     (((uint16_t)(((uint16_t)(x))<<PWM_OCTRL_PWMX_IN_SHIFT))&PWM_OCTRL_PWMX_IN_MASK)
#define PWM_OCTRL_PWMB_IN_MASK                   0x4000u
#define PWM_OCTRL_PWMB_IN_SHIFT                  14
#define PWM_OCTRL_PWMB_IN_WIDTH                  1
#define PWM_OCTRL_PWMB_IN(x)                     (((uint16_t)(((uint16_t)(x))<<PWM_OCTRL_PWMB_IN_SHIFT))&PWM_OCTRL_PWMB_IN_MASK)
#define PWM_OCTRL_PWMA_IN_MASK                   0x8000u
#define PWM_OCTRL_PWMA_IN_SHIFT                  15
#define PWM_OCTRL_PWMA_IN_WIDTH                  1
#define PWM_OCTRL_PWMA_IN(x)                     (((uint16_t)(((uint16_t)(x))<<PWM_OCTRL_PWMA_IN_SHIFT))&PWM_OCTRL_PWMA_IN_MASK)
/* STS Bit Fields */
#define PWM_STS_CMPF_MASK                        0x3Fu
#define PWM_STS_CMPF_SHIFT                       0
#define PWM_STS_CMPF_WIDTH                       6
#define PWM_STS_CMPF(x)                          (((uint16_t)(((uint16_t)(x))<<PWM_STS_CMPF_SHIFT))&PWM_STS_CMPF_MASK)
#define PWM_STS_CFX0_MASK                        0x40u
#define PWM_STS_CFX0_SHIFT                       6
#define PWM_STS_CFX0_WIDTH                       1
#define PWM_STS_CFX0(x)                          (((uint16_t)(((uint16_t)(x))<<PWM_STS_CFX0_SHIFT))&PWM_STS_CFX0_MASK)
#define PWM_STS_CFX1_MASK                        0x80u
#define PWM_STS_CFX1_SHIFT                       7
#define PWM_STS_CFX1_WIDTH                       1
#define PWM_STS_CFX1(x)                          (((uint16_t)(((uint16_t)(x))<<PWM_STS_CFX1_SHIFT))&PWM_STS_CFX1_MASK)
#define PWM_STS_CFB0_MASK                        0x100u
#define PWM_STS_CFB0_SHIFT                       8
#define PWM_STS_CFB0_WIDTH                       1
#define PWM_STS_CFB0(x)                          (((uint16_t)(((uint16_t)(x))<<PWM_STS_CFB0_SHIFT))&PWM_STS_CFB0_MASK)
#define PWM_STS_CFB1_MASK                        0x200u
#define PWM_STS_CFB1_SHIFT                       9
#define PWM_STS_CFB1_WIDTH                       1
#define PWM_STS_CFB1(x)                          (((uint16_t)(((uint16_t)(x))<<PWM_STS_CFB1_SHIFT))&PWM_STS_CFB1_MASK)
#define PWM_STS_CFA0_MASK                        0x400u
#define PWM_STS_CFA0_SHIFT                       10
#define PWM_STS_CFA0_WIDTH                       1
#define PWM_STS_CFA0(x)                          (((uint16_t)(((uint16_t)(x))<<PWM_STS_CFA0_SHIFT))&PWM_STS_CFA0_MASK)
#define PWM_STS_CFA1_MASK                        0x800u
#define PWM_STS_CFA1_SHIFT                       11
#define PWM_STS_CFA1_WIDTH                       1
#define PWM_STS_CFA1(x)                          (((uint16_t)(((uint16_t)(x))<<PWM_STS_CFA1_SHIFT))&PWM_STS_CFA1_MASK)
#define PWM_STS_RF_MASK                          0x1000u
#define PWM_STS_RF_SHIFT                         12
#define PWM_STS_RF_WIDTH                         1
#define PWM_STS_RF(x)                            (((uint16_t)(((uint16_t)(x))<<PWM_STS_RF_SHIFT))&PWM_STS_RF_MASK)
#define PWM_STS_REF_MASK                         0x2000u
#define PWM_STS_REF_SHIFT                        13
#define PWM_STS_REF_WIDTH                        1
#define PWM_STS_REF(x)                           (((uint16_t)(((uint16_t)(x))<<PWM_STS_REF_SHIFT))&PWM_STS_REF_MASK)
#define PWM_STS_RUF_MASK                         0x4000u
#define PWM_STS_RUF_SHIFT                        14
#define PWM_STS_RUF_WIDTH                        1
#define PWM_STS_RUF(x)                           (((uint16_t)(((uint16_t)(x))<<PWM_STS_RUF_SHIFT))&PWM_STS_RUF_MASK)
/* INTEN Bit Fields */
#define PWM_INTEN_CMPIE_MASK                     0x3Fu
#define PWM_INTEN_CMPIE_SHIFT                    0
#define PWM_INTEN_CMPIE_WIDTH                    6
#define PWM_INTEN_CMPIE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_INTEN_CMPIE_SHIFT))&PWM_INTEN_CMPIE_MASK)
#define PWM_INTEN_CX0IE_MASK                     0x40u
#define PWM_INTEN_CX0IE_SHIFT                    6
#define PWM_INTEN_CX0IE_WIDTH                    1
#define PWM_INTEN_CX0IE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_INTEN_CX0IE_SHIFT))&PWM_INTEN_CX0IE_MASK)
#define PWM_INTEN_CX1IE_MASK                     0x80u
#define PWM_INTEN_CX1IE_SHIFT                    7
#define PWM_INTEN_CX1IE_WIDTH                    1
#define PWM_INTEN_CX1IE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_INTEN_CX1IE_SHIFT))&PWM_INTEN_CX1IE_MASK)
#define PWM_INTEN_CB0IE_MASK                     0x100u
#define PWM_INTEN_CB0IE_SHIFT                    8
#define PWM_INTEN_CB0IE_WIDTH                    1
#define PWM_INTEN_CB0IE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_INTEN_CB0IE_SHIFT))&PWM_INTEN_CB0IE_MASK)
#define PWM_INTEN_CB1IE_MASK                     0x200u
#define PWM_INTEN_CB1IE_SHIFT                    9
#define PWM_INTEN_CB1IE_WIDTH                    1
#define PWM_INTEN_CB1IE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_INTEN_CB1IE_SHIFT))&PWM_INTEN_CB1IE_MASK)
#define PWM_INTEN_CA0IE_MASK                     0x400u
#define PWM_INTEN_CA0IE_SHIFT                    10
#define PWM_INTEN_CA0IE_WIDTH                    1
#define PWM_INTEN_CA0IE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_INTEN_CA0IE_SHIFT))&PWM_INTEN_CA0IE_MASK)
#define PWM_INTEN_CA1IE_MASK                     0x800u
#define PWM_INTEN_CA1IE_SHIFT                    11
#define PWM_INTEN_CA1IE_WIDTH                    1
#define PWM_INTEN_CA1IE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_INTEN_CA1IE_SHIFT))&PWM_INTEN_CA1IE_MASK)
#define PWM_INTEN_RIE_MASK                       0x1000u
#define PWM_INTEN_RIE_SHIFT                      12
#define PWM_INTEN_RIE_WIDTH                      1
#define PWM_INTEN_RIE(x)                         (((uint16_t)(((uint16_t)(x))<<PWM_INTEN_RIE_SHIFT))&PWM_INTEN_RIE_MASK)
#define PWM_INTEN_REIE_MASK                      0x2000u
#define PWM_INTEN_REIE_SHIFT                     13
#define PWM_INTEN_REIE_WIDTH                     1
#define PWM_INTEN_REIE(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_INTEN_REIE_SHIFT))&PWM_INTEN_REIE_MASK)
/* DMAEN Bit Fields */
#define PWM_DMAEN_CX0DE_MASK                     0x1u
#define PWM_DMAEN_CX0DE_SHIFT                    0
#define PWM_DMAEN_CX0DE_WIDTH                    1
#define PWM_DMAEN_CX0DE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_DMAEN_CX0DE_SHIFT))&PWM_DMAEN_CX0DE_MASK)
#define PWM_DMAEN_CX1DE_MASK                     0x2u
#define PWM_DMAEN_CX1DE_SHIFT                    1
#define PWM_DMAEN_CX1DE_WIDTH                    1
#define PWM_DMAEN_CX1DE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_DMAEN_CX1DE_SHIFT))&PWM_DMAEN_CX1DE_MASK)
#define PWM_DMAEN_CB0DE_MASK                     0x4u
#define PWM_DMAEN_CB0DE_SHIFT                    2
#define PWM_DMAEN_CB0DE_WIDTH                    1
#define PWM_DMAEN_CB0DE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_DMAEN_CB0DE_SHIFT))&PWM_DMAEN_CB0DE_MASK)
#define PWM_DMAEN_CB1DE_MASK                     0x8u
#define PWM_DMAEN_CB1DE_SHIFT                    3
#define PWM_DMAEN_CB1DE_WIDTH                    1
#define PWM_DMAEN_CB1DE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_DMAEN_CB1DE_SHIFT))&PWM_DMAEN_CB1DE_MASK)
#define PWM_DMAEN_CA0DE_MASK                     0x10u
#define PWM_DMAEN_CA0DE_SHIFT                    4
#define PWM_DMAEN_CA0DE_WIDTH                    1
#define PWM_DMAEN_CA0DE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_DMAEN_CA0DE_SHIFT))&PWM_DMAEN_CA0DE_MASK)
#define PWM_DMAEN_CA1DE_MASK                     0x20u
#define PWM_DMAEN_CA1DE_SHIFT                    5
#define PWM_DMAEN_CA1DE_WIDTH                    1
#define PWM_DMAEN_CA1DE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_DMAEN_CA1DE_SHIFT))&PWM_DMAEN_CA1DE_MASK)
#define PWM_DMAEN_CAPTDE_MASK                    0xC0u
#define PWM_DMAEN_CAPTDE_SHIFT                   6
#define PWM_DMAEN_CAPTDE_WIDTH                   2
#define PWM_DMAEN_CAPTDE(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_DMAEN_CAPTDE_SHIFT))&PWM_DMAEN_CAPTDE_MASK)
#define PWM_DMAEN_FAND_MASK                      0x100u
#define PWM_DMAEN_FAND_SHIFT                     8
#define PWM_DMAEN_FAND_WIDTH                     1
#define PWM_DMAEN_FAND(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_DMAEN_FAND_SHIFT))&PWM_DMAEN_FAND_MASK)
#define PWM_DMAEN_VALDE_MASK                     0x200u
#define PWM_DMAEN_VALDE_SHIFT                    9
#define PWM_DMAEN_VALDE_WIDTH                    1
#define PWM_DMAEN_VALDE(x)                       (((uint16_t)(((uint16_t)(x))<<PWM_DMAEN_VALDE_SHIFT))&PWM_DMAEN_VALDE_MASK)
/* TCTRL Bit Fields */
#define PWM_TCTRL_OUT_TRIG_EN_MASK               0x3Fu
#define PWM_TCTRL_OUT_TRIG_EN_SHIFT              0
#define PWM_TCTRL_OUT_TRIG_EN_WIDTH              6
#define PWM_TCTRL_OUT_TRIG_EN(x)                 (((uint16_t)(((uint16_t)(x))<<PWM_TCTRL_OUT_TRIG_EN_SHIFT))&PWM_TCTRL_OUT_TRIG_EN_MASK)
#define PWM_TCTRL_TRGFRQ_MASK                    0x1000u
#define PWM_TCTRL_TRGFRQ_SHIFT                   12
#define PWM_TCTRL_TRGFRQ_WIDTH                   1
#define PWM_TCTRL_TRGFRQ(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_TCTRL_TRGFRQ_SHIFT))&PWM_TCTRL_TRGFRQ_MASK)
#define PWM_TCTRL_PWBOT1_MASK                    0x4000u
#define PWM_TCTRL_PWBOT1_SHIFT                   14
#define PWM_TCTRL_PWBOT1_WIDTH                   1
#define PWM_TCTRL_PWBOT1(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_TCTRL_PWBOT1_SHIFT))&PWM_TCTRL_PWBOT1_MASK)
#define PWM_TCTRL_PWAOT0_MASK                    0x8000u
#define PWM_TCTRL_PWAOT0_SHIFT                   15
#define PWM_TCTRL_PWAOT0_WIDTH                   1
#define PWM_TCTRL_PWAOT0(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_TCTRL_PWAOT0_SHIFT))&PWM_TCTRL_PWAOT0_MASK)
/* DISMAP Bit Fields */
#define PWM_DISMAP_DIS0A_MASK                    0xFu
#define PWM_DISMAP_DIS0A_SHIFT                   0
#define PWM_DISMAP_DIS0A_WIDTH                   4
#define PWM_DISMAP_DIS0A(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_DISMAP_DIS0A_SHIFT))&PWM_DISMAP_DIS0A_MASK)
#define PWM_DISMAP_DIS0B_MASK                    0xF0u
#define PWM_DISMAP_DIS0B_SHIFT                   4
#define PWM_DISMAP_DIS0B_WIDTH                   4
#define PWM_DISMAP_DIS0B(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_DISMAP_DIS0B_SHIFT))&PWM_DISMAP_DIS0B_MASK)
#define PWM_DISMAP_DIS0X_MASK                    0xF00u
#define PWM_DISMAP_DIS0X_SHIFT                   8
#define PWM_DISMAP_DIS0X_WIDTH                   4
#define PWM_DISMAP_DIS0X(x)                      (((uint16_t)(((uint16_t)(x))<<PWM_DISMAP_DIS0X_SHIFT))&PWM_DISMAP_DIS0X_MASK)
/* DTCNT0 Bit Fields */
#define PWM_DTCNT0_DTCNT0_MASK                   0xFFFFu
#define PWM_DTCNT0_DTCNT0_SHIFT                  0
#define PWM_DTCNT0_DTCNT0_WIDTH                  16
