ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/devices/MKV58F24/include/MKV58F24.h
#define PWM_FSTS_FFULL(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_FSTS_FFULL_SHIFT))&PWM_FSTS_FFULL_MASK)
#define PWM_FSTS_FFPIN_MASK                      0xF00u
#define PWM_FSTS_FFPIN_SHIFT                     8
#define PWM_FSTS_FFPIN_WIDTH                     4
#define PWM_FSTS_FFPIN(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_FSTS_FFPIN_SHIFT))&PWM_FSTS_FFPIN_MASK)
#define PWM_FSTS_FHALF_MASK                      0xF000u
#define PWM_FSTS_FHALF_SHIFT                     12
#define PWM_FSTS_FHALF_WIDTH                     4
#define PWM_FSTS_FHALF(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_FSTS_FHALF_SHIFT))&PWM_FSTS_FHALF_MASK)
/* FFILT Bit Fields */
#define PWM_FFILT_FILT_PER_MASK                  0xFFu
#define PWM_FFILT_FILT_PER_SHIFT                 0
#define PWM_FFILT_FILT_PER_WIDTH                 8
#define PWM_FFILT_FILT_PER(x)                    (((uint16_t)(((uint16_t)(x))<<PWM_FFILT_FILT_PER_SHIFT))&PWM_FFILT_FILT_PER_MASK)
#define PWM_FFILT_FILT_CNT_MASK                  0x700u
#define PWM_FFILT_FILT_CNT_SHIFT                 8
#define PWM_FFILT_FILT_CNT_WIDTH                 3
#define PWM_FFILT_FILT_CNT(x)                    (((uint16_t)(((uint16_t)(x))<<PWM_FFILT_FILT_CNT_SHIFT))&PWM_FFILT_FILT_CNT_MASK)
#define PWM_FFILT_GSTR_MASK                      0x8000u
#define PWM_FFILT_GSTR_SHIFT                     15
#define PWM_FFILT_GSTR_WIDTH                     1
#define PWM_FFILT_GSTR(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_FFILT_GSTR_SHIFT))&PWM_FFILT_GSTR_MASK)
/* FTST Bit Fields */
#define PWM_FTST_FTEST_MASK                      0x1u
#define PWM_FTST_FTEST_SHIFT                     0
#define PWM_FTST_FTEST_WIDTH                     1
#define PWM_FTST_FTEST(x)                        (((uint16_t)(((uint16_t)(x))<<PWM_FTST_FTEST_SHIFT))&PWM_FTST_FTEST_MASK)
/* FCTRL2 Bit Fields */
#define PWM_FCTRL2_NOCOMB_MASK                   0xFu
#define PWM_FCTRL2_NOCOMB_SHIFT                  0
#define PWM_FCTRL2_NOCOMB_WIDTH                  4
#define PWM_FCTRL2_NOCOMB(x)                     (((uint16_t)(((uint16_t)(x))<<PWM_FCTRL2_NOCOMB_SHIFT))&PWM_FCTRL2_NOCOMB_MASK)

/*!
 * @}
 */ /* end of group PWM_Register_Masks */


/* PWM - Peripheral instance base addresses */
/** Peripheral PWM0 base address */
#define PWM0_BASE                                (0x40033000u)
/** Peripheral PWM0 base pointer */
#define PWM0                                     ((PWM_Type *)PWM0_BASE)
#define PWM0_BASE_PTR                            (PWM0)
/** Peripheral PWM1 base address */
#define PWM1_BASE                                (0x400B3000u)
/** Peripheral PWM1 base pointer */
#define PWM1                                     ((PWM_Type *)PWM1_BASE)
#define PWM1_BASE_PTR                            (PWM1)
/** Array initializer of PWM peripheral base addresses */
#define PWM_BASE_ADDRS                           { PWM0_BASE, PWM1_BASE }
/** Array initializer of PWM peripheral base pointers */
#define PWM_BASE_PTRS                            { PWM0, PWM1 }
/** Interrupt vectors for the PWM peripheral type */
#define PWM_CMP_IRQS                             { { PWM0_CMP0_IRQn, PWM0_CMP1_IRQn, PWM0_CMP2_IRQn, PWM0_CMP3_IRQn }, { PWM1_CMP0_IRQn, PWM1_CMP1_IRQn, PWM1_CMP2_IRQn, PWM1_CMP3_IRQn } }
#define PWM_RELOAD_IRQS                          { { PWM0_RELOAD0_IRQn, PWM0_RELOAD1_IRQn, PWM0_RELOAD2_IRQn, PWM0_RELOAD3_IRQn }, { PWM1_RELOAD0_IRQn, PWM1_RELOAD1_IRQn, PWM1_RELOAD2_IRQn, PWM1_RELOAD3_IRQn } }
#define PWM_CAP_IRQS                             { PWM0_CAP_IRQn, PWM1_CAP_IRQn }
#define PWM_RERR_IRQS                            { PWM0_RERR_IRQn, PWM1_RERR_IRQn }
#define PWM_FAULT_IRQS                           { PWM0_FAULT_IRQn, PWM1_FAULT_IRQn }

/* ----------------------------------------------------------------------------
   -- PWM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PWM_Register_Accessor_Macros PWM - Register accessor macros
 * @{
 */


/* PWM - Register instance definitions */
/* PWM0 */
#define PWM0_SM0CNT                              PWM_CNT_REG(PWM0,0)
#define PWM0_SM0INIT                             PWM_INIT_REG(PWM0,0)
#define PWM0_SM0CTRL2                            PWM_CTRL2_REG(PWM0,0)
#define PWM0_SM0CTRL                             PWM_CTRL_REG(PWM0,0)
#define PWM0_SM0VAL0                             PWM_VAL0_REG(PWM0,0)
#define PWM0_SM0FRACVAL1                         PWM_FRACVAL1_REG(PWM0,0)
#define PWM0_SM0VAL1                             PWM_VAL1_REG(PWM0,0)
#define PWM0_SM0FRACVAL2                         PWM_FRACVAL2_REG(PWM0,0)
#define PWM0_SM0VAL2                             PWM_VAL2_REG(PWM0,0)
#define PWM0_SM0FRACVAL3                         PWM_FRACVAL3_REG(PWM0,0)
#define PWM0_SM0VAL3                             PWM_VAL3_REG(PWM0,0)
#define PWM0_SM0FRACVAL4                         PWM_FRACVAL4_REG(PWM0,0)
#define PWM0_SM0VAL4                             PWM_VAL4_REG(PWM0,0)
#define PWM0_SM0FRACVAL5                         PWM_FRACVAL5_REG(PWM0,0)
#define PWM0_SM0VAL5                             PWM_VAL5_REG(PWM0,0)
#define PWM0_SM0FRCTRL                           PWM_FRCTRL_REG(PWM0,0)
#define PWM0_SM0OCTRL                            PWM_OCTRL_REG(PWM0,0)
#define PWM0_SM0STS                              PWM_STS_REG(PWM0,0)
#define PWM0_SM0INTEN                            PWM_INTEN_REG(PWM0,0)
#define PWM0_SM0DMAEN                            PWM_DMAEN_REG(PWM0,0)
#define PWM0_SM0TCTRL                            PWM_TCTRL_REG(PWM0,0)
#define PWM0_SM0DISMAP0                          PWM_DISMAP_REG(PWM0,0,0)
#define PWM0_SM0DTCNT0                           PWM_DTCNT0_REG(PWM0,0)
#define PWM0_SM0DTCNT1                           PWM_DTCNT1_REG(PWM0,0)
#define PWM0_SM0CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM0,0)
#define PWM0_SM0CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM0,0)
#define PWM0_SM0CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM0,0)
#define PWM0_SM0CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM0,0)
#define PWM0_SM0CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM0,0)
#define PWM0_SM0CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM0,0)
#define PWM0_SM0CVAL0                            PWM_CVAL0_REG(PWM0,0)
#define PWM0_SM0CVAL0CYC                         PWM_CVAL0CYC_REG(PWM0,0)
#define PWM0_SM0CVAL1                            PWM_CVAL1_REG(PWM0,0)
#define PWM0_SM0CVAL1CYC                         PWM_CVAL1CYC_REG(PWM0,0)
#define PWM0_SM0CVAL2                            PWM_CVAL2_REG(PWM0,0)
#define PWM0_SM0CVAL2CYC                         PWM_CVAL2CYC_REG(PWM0,0)
#define PWM0_SM0CVAL3                            PWM_CVAL3_REG(PWM0,0)
#define PWM0_SM0CVAL3CYC                         PWM_CVAL3CYC_REG(PWM0,0)
#define PWM0_SM0CVAL4                            PWM_CVAL4_REG(PWM0,0)
#define PWM0_SM0CVAL4CYC                         PWM_CVAL4CYC_REG(PWM0,0)
#define PWM0_SM0CVAL5                            PWM_CVAL5_REG(PWM0,0)
#define PWM0_SM0CVAL5CYC                         PWM_CVAL5CYC_REG(PWM0,0)
#define PWM0_SM1CNT                              PWM_CNT_REG(PWM0,1)
#define PWM0_SM1INIT                             PWM_INIT_REG(PWM0,1)
#define PWM0_SM1CTRL2                            PWM_CTRL2_REG(PWM0,1)
#define PWM0_SM1CTRL                             PWM_CTRL_REG(PWM0,1)
#define PWM0_SM1VAL0                             PWM_VAL0_REG(PWM0,1)
#define PWM0_SM1FRACVAL1                         PWM_FRACVAL1_REG(PWM0,1)
#define PWM0_SM1VAL1                             PWM_VAL1_REG(PWM0,1)
#define PWM0_SM1FRACVAL2                         PWM_FRACVAL2_REG(PWM0,1)
#define PWM0_SM1VAL2                             PWM_VAL2_REG(PWM0,1)
#define PWM0_SM1FRACVAL3                         PWM_FRACVAL3_REG(PWM0,1)
#define PWM0_SM1VAL3                             PWM_VAL3_REG(PWM0,1)
#define PWM0_SM1FRACVAL4                         PWM_FRACVAL4_REG(PWM0,1)
#define PWM0_SM1VAL4                             PWM_VAL4_REG(PWM0,1)
#define PWM0_SM1FRACVAL5                         PWM_FRACVAL5_REG(PWM0,1)
#define PWM0_SM1VAL5                             PWM_VAL5_REG(PWM0,1)
#define PWM0_SM1FRCTRL                           PWM_FRCTRL_REG(PWM0,1)
#define PWM0_SM1OCTRL                            PWM_OCTRL_REG(PWM0,1)
#define PWM0_SM1STS                              PWM_STS_REG(PWM0,1)
#define PWM0_SM1INTEN                            PWM_INTEN_REG(PWM0,1)
#define PWM0_SM1DMAEN                            PWM_DMAEN_REG(PWM0,1)
#define PWM0_SM1TCTRL                            PWM_TCTRL_REG(PWM0,1)
#define PWM0_SM1DISMAP0                          PWM_DISMAP_REG(PWM0,1,0)
#define PWM0_SM1DTCNT0                           PWM_DTCNT0_REG(PWM0,1)
#define PWM0_SM1DTCNT1                           PWM_DTCNT1_REG(PWM0,1)
#define PWM0_SM1CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM0,1)
#define PWM0_SM1CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM0,1)
#define PWM0_SM1CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM0,1)
#define PWM0_SM1CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM0,1)
#define PWM0_SM1CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM0,1)
#define PWM0_SM1CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM0,1)
#define PWM0_SM1CVAL0                            PWM_CVAL0_REG(PWM0,1)
#define PWM0_SM1CVAL0CYC                         PWM_CVAL0CYC_REG(PWM0,1)
#define PWM0_SM1CVAL1                            PWM_CVAL1_REG(PWM0,1)
#define PWM0_SM1CVAL1CYC                         PWM_CVAL1CYC_REG(PWM0,1)
#define PWM0_SM1CVAL2                            PWM_CVAL2_REG(PWM0,1)
#define PWM0_SM1CVAL2CYC                         PWM_CVAL2CYC_REG(PWM0,1)
#define PWM0_SM1CVAL3                            PWM_CVAL3_REG(PWM0,1)
#define PWM0_SM1CVAL3CYC                         PWM_CVAL3CYC_REG(PWM0,1)
#define PWM0_SM1CVAL4                            PWM_CVAL4_REG(PWM0,1)
#define PWM0_SM1CVAL4CYC                         PWM_CVAL4CYC_REG(PWM0,1)
#define PWM0_SM1CVAL5                            PWM_CVAL5_REG(PWM0,1)
#define PWM0_SM1CVAL5CYC                         PWM_CVAL5CYC_REG(PWM0,1)
#define PWM0_SM2CNT                              PWM_CNT_REG(PWM0,2)
#define PWM0_SM2INIT                             PWM_INIT_REG(PWM0,2)
#define PWM0_SM2CTRL2                            PWM_CTRL2_REG(PWM0,2)
#define PWM0_SM2CTRL                             PWM_CTRL_REG(PWM0,2)
#define PWM0_SM2VAL0                             PWM_VAL0_REG(PWM0,2)
#define PWM0_SM2FRACVAL1                         PWM_FRACVAL1_REG(PWM0,2)
#define PWM0_SM2VAL1                             PWM_VAL1_REG(PWM0,2)
#define PWM0_SM2FRACVAL2                         PWM_FRACVAL2_REG(PWM0,2)
#define PWM0_SM2VAL2                             PWM_VAL2_REG(PWM0,2)
#define PWM0_SM2FRACVAL3                         PWM_FRACVAL3_REG(PWM0,2)
#define PWM0_SM2VAL3                             PWM_VAL3_REG(PWM0,2)
#define PWM0_SM2FRACVAL4                         PWM_FRACVAL4_REG(PWM0,2)
#define PWM0_SM2VAL4                             PWM_VAL4_REG(PWM0,2)
#define PWM0_SM2FRACVAL5                         PWM_FRACVAL5_REG(PWM0,2)
#define PWM0_SM2VAL5                             PWM_VAL5_REG(PWM0,2)
#define PWM0_SM2FRCTRL                           PWM_FRCTRL_REG(PWM0,2)
#define PWM0_SM2OCTRL                            PWM_OCTRL_REG(PWM0,2)
#define PWM0_SM2STS                              PWM_STS_REG(PWM0,2)
#define PWM0_SM2INTEN                            PWM_INTEN_REG(PWM0,2)
#define PWM0_SM2DMAEN                            PWM_DMAEN_REG(PWM0,2)
#define PWM0_SM2TCTRL                            PWM_TCTRL_REG(PWM0,2)
#define PWM0_SM2DISMAP0                          PWM_DISMAP_REG(PWM0,2,0)
#define PWM0_SM2DTCNT0                           PWM_DTCNT0_REG(PWM0,2)
#define PWM0_SM2DTCNT1                           PWM_DTCNT1_REG(PWM0,2)
#define PWM0_SM2CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM0,2)
#define PWM0_SM2CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM0,2)
#define PWM0_SM2CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM0,2)
#define PWM0_SM2CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM0,2)
#define PWM0_SM2CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM0,2)
#define PWM0_SM2CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM0,2)
#define PWM0_SM2CVAL0                            PWM_CVAL0_REG(PWM0,2)
#define PWM0_SM2CVAL0CYC                         PWM_CVAL0CYC_REG(PWM0,2)
#define PWM0_SM2CVAL1                            PWM_CVAL1_REG(PWM0,2)
#define PWM0_SM2CVAL1CYC                         PWM_CVAL1CYC_REG(PWM0,2)
#define PWM0_SM2CVAL2                            PWM_CVAL2_REG(PWM0,2)
#define PWM0_SM2CVAL2CYC                         PWM_CVAL2CYC_REG(PWM0,2)
#define PWM0_SM2CVAL3                            PWM_CVAL3_REG(PWM0,2)
#define PWM0_SM2CVAL3CYC                         PWM_CVAL3CYC_REG(PWM0,2)
#define PWM0_SM2CVAL4                            PWM_CVAL4_REG(PWM0,2)
#define PWM0_SM2CVAL4CYC                         PWM_CVAL4CYC_REG(PWM0,2)
#define PWM0_SM2CVAL5                            PWM_CVAL5_REG(PWM0,2)
#define PWM0_SM2CVAL5CYC                         PWM_CVAL5CYC_REG(PWM0,2)
#define PWM0_SM3CNT                              PWM_CNT_REG(PWM0,3)
#define PWM0_SM3INIT                             PWM_INIT_REG(PWM0,3)
#define PWM0_SM3CTRL2                            PWM_CTRL2_REG(PWM0,3)
#define PWM0_SM3CTRL                             PWM_CTRL_REG(PWM0,3)
#define PWM0_SM3VAL0                             PWM_VAL0_REG(PWM0,3)
#define PWM0_SM3FRACVAL1                         PWM_FRACVAL1_REG(PWM0,3)
#define PWM0_SM3VAL1                             PWM_VAL1_REG(PWM0,3)
#define PWM0_SM3FRACVAL2                         PWM_FRACVAL2_REG(PWM0,3)
#define PWM0_SM3VAL2                             PWM_VAL2_REG(PWM0,3)
#define PWM0_SM3FRACVAL3                         PWM_FRACVAL3_REG(PWM0,3)
#define PWM0_SM3VAL3                             PWM_VAL3_REG(PWM0,3)
#define PWM0_SM3FRACVAL4                         PWM_FRACVAL4_REG(PWM0,3)
#define PWM0_SM3VAL4                             PWM_VAL4_REG(PWM0,3)
#define PWM0_SM3FRACVAL5                         PWM_FRACVAL5_REG(PWM0,3)
#define PWM0_SM3VAL5                             PWM_VAL5_REG(PWM0,3)
#define PWM0_SM3FRCTRL                           PWM_FRCTRL_REG(PWM0,3)
#define PWM0_SM3OCTRL                            PWM_OCTRL_REG(PWM0,3)
#define PWM0_SM3STS                              PWM_STS_REG(PWM0,3)
#define PWM0_SM3INTEN                            PWM_INTEN_REG(PWM0,3)
#define PWM0_SM3DMAEN                            PWM_DMAEN_REG(PWM0,3)
#define PWM0_SM3TCTRL                            PWM_TCTRL_REG(PWM0,3)
#define PWM0_SM3DISMAP0                          PWM_DISMAP_REG(PWM0,3,0)
#define PWM0_SM3DTCNT0                           PWM_DTCNT0_REG(PWM0,3)
#define PWM0_SM3DTCNT1                           PWM_DTCNT1_REG(PWM0,3)
#define PWM0_SM3CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM0,3)
#define PWM0_SM3CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM0,3)
#define PWM0_SM3CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM0,3)
#define PWM0_SM3CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM0,3)
#define PWM0_SM3CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM0,3)
#define PWM0_SM3CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM0,3)
#define PWM0_SM3CVAL0                            PWM_CVAL0_REG(PWM0,3)
#define PWM0_SM3CVAL0CYC                         PWM_CVAL0CYC_REG(PWM0,3)
#define PWM0_SM3CVAL1                            PWM_CVAL1_REG(PWM0,3)
#define PWM0_SM3CVAL1CYC                         PWM_CVAL1CYC_REG(PWM0,3)
#define PWM0_SM3CVAL2                            PWM_CVAL2_REG(PWM0,3)
#define PWM0_SM3CVAL2CYC                         PWM_CVAL2CYC_REG(PWM0,3)
#define PWM0_SM3CVAL3                            PWM_CVAL3_REG(PWM0,3)
#define PWM0_SM3CVAL3CYC                         PWM_CVAL3CYC_REG(PWM0,3)
#define PWM0_SM3CVAL4                            PWM_CVAL4_REG(PWM0,3)
#define PWM0_SM3CVAL4CYC                         PWM_CVAL4CYC_REG(PWM0,3)
#define PWM0_SM3CVAL5                            PWM_CVAL5_REG(PWM0,3)
#define PWM0_SM3CVAL5CYC                         PWM_CVAL5CYC_REG(PWM0,3)
#define PWM0_OUTEN                               PWM_OUTEN_REG(PWM0)
#define PWM0_MASK                                PWM_MASK_REG(PWM0)
#define PWM0_SWCOUT                              PWM_SWCOUT_REG(PWM0)
#define PWM0_DTSRCSEL                            PWM_DTSRCSEL_REG(PWM0)
#define PWM0_MCTRL0                              PWM_MCTRL_REG(PWM0)
#define PWM0_MCTRL1                              PWM_MCTRL2_REG(PWM0)
#define PWM0_FCTRL0                              PWM_FCTRL_REG(PWM0)
#define PWM0_FSTS0                               PWM_FSTS_REG(PWM0)
#define PWM0_FFILT0                              PWM_FFILT_REG(PWM0)
#define PWM0_FTST0                               PWM_FTST_REG(PWM0)
#define PWM0_FCTRL20                             PWM_FCTRL2_REG(PWM0)
/* PWM1 */
#define PWM1_SM0CNT                              PWM_CNT_REG(PWM1,0)
#define PWM1_SM0INIT                             PWM_INIT_REG(PWM1,0)
#define PWM1_SM0CTRL2                            PWM_CTRL2_REG(PWM1,0)
#define PWM1_SM0CTRL                             PWM_CTRL_REG(PWM1,0)
#define PWM1_SM0VAL0                             PWM_VAL0_REG(PWM1,0)
#define PWM1_SM0FRACVAL1                         PWM_FRACVAL1_REG(PWM1,0)
#define PWM1_SM0VAL1                             PWM_VAL1_REG(PWM1,0)
#define PWM1_SM0FRACVAL2                         PWM_FRACVAL2_REG(PWM1,0)
#define PWM1_SM0VAL2                             PWM_VAL2_REG(PWM1,0)
#define PWM1_SM0FRACVAL3                         PWM_FRACVAL3_REG(PWM1,0)
#define PWM1_SM0VAL3                             PWM_VAL3_REG(PWM1,0)
#define PWM1_SM0FRACVAL4                         PWM_FRACVAL4_REG(PWM1,0)
#define PWM1_SM0VAL4                             PWM_VAL4_REG(PWM1,0)
#define PWM1_SM0FRACVAL5                         PWM_FRACVAL5_REG(PWM1,0)
#define PWM1_SM0VAL5                             PWM_VAL5_REG(PWM1,0)
#define PWM1_SM0FRCTRL                           PWM_FRCTRL_REG(PWM1,0)
#define PWM1_SM0OCTRL                            PWM_OCTRL_REG(PWM1,0)
#define PWM1_SM0STS                              PWM_STS_REG(PWM1,0)
#define PWM1_SM0INTEN                            PWM_INTEN_REG(PWM1,0)
#define PWM1_SM0DMAEN                            PWM_DMAEN_REG(PWM1,0)
#define PWM1_SM0TCTRL                            PWM_TCTRL_REG(PWM1,0)
#define PWM1_SM0DISMAP0                          PWM_DISMAP_REG(PWM1,0,0)
#define PWM1_SM0DTCNT0                           PWM_DTCNT0_REG(PWM1,0)
#define PWM1_SM0DTCNT1                           PWM_DTCNT1_REG(PWM1,0)
#define PWM1_SM0CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM1,0)
#define PWM1_SM0CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM1,0)
#define PWM1_SM0CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM1,0)
#define PWM1_SM0CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM1,0)
#define PWM1_SM0CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM1,0)
#define PWM1_SM0CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM1,0)
#define PWM1_SM0CVAL0                            PWM_CVAL0_REG(PWM1,0)
#define PWM1_SM0CVAL0CYC                         PWM_CVAL0CYC_REG(PWM1,0)
#define PWM1_SM0CVAL1                            PWM_CVAL1_REG(PWM1,0)
#define PWM1_SM0CVAL1CYC                         PWM_CVAL1CYC_REG(PWM1,0)
#define PWM1_SM0CVAL2                            PWM_CVAL2_REG(PWM1,0)
#define PWM1_SM0CVAL2CYC                         PWM_CVAL2CYC_REG(PWM1,0)
#define PWM1_SM0CVAL3                            PWM_CVAL3_REG(PWM1,0)
#define PWM1_SM0CVAL3CYC                         PWM_CVAL3CYC_REG(PWM1,0)
#define PWM1_SM0CVAL4                            PWM_CVAL4_REG(PWM1,0)
#define PWM1_SM0CVAL4CYC                         PWM_CVAL4CYC_REG(PWM1,0)
#define PWM1_SM0CVAL5                            PWM_CVAL5_REG(PWM1,0)
#define PWM1_SM0CVAL5CYC                         PWM_CVAL5CYC_REG(PWM1,0)
#define PWM1_SM1CNT                              PWM_CNT_REG(PWM1,1)
#define PWM1_SM1INIT                             PWM_INIT_REG(PWM1,1)
#define PWM1_SM1CTRL2                            PWM_CTRL2_REG(PWM1,1)
#define PWM1_SM1CTRL                             PWM_CTRL_REG(PWM1,1)
#define PWM1_SM1VAL0                             PWM_VAL0_REG(PWM1,1)
#define PWM1_SM1FRACVAL1                         PWM_FRACVAL1_REG(PWM1,1)
#define PWM1_SM1VAL1                             PWM_VAL1_REG(PWM1,1)
#define PWM1_SM1FRACVAL2                         PWM_FRACVAL2_REG(PWM1,1)
#define PWM1_SM1VAL2                             PWM_VAL2_REG(PWM1,1)
#define PWM1_SM1FRACVAL3                         PWM_FRACVAL3_REG(PWM1,1)
#define PWM1_SM1VAL3                             PWM_VAL3_REG(PWM1,1)
#define PWM1_SM1FRACVAL4                         PWM_FRACVAL4_REG(PWM1,1)
#define PWM1_SM1VAL4                             PWM_VAL4_REG(PWM1,1)
#define PWM1_SM1FRACVAL5                         PWM_FRACVAL5_REG(PWM1,1)
#define PWM1_SM1VAL5                             PWM_VAL5_REG(PWM1,1)
#define PWM1_SM1FRCTRL                           PWM_FRCTRL_REG(PWM1,1)
#define PWM1_SM1OCTRL                            PWM_OCTRL_REG(PWM1,1)
#define PWM1_SM1STS                              PWM_STS_REG(PWM1,1)
#define PWM1_SM1INTEN                            PWM_INTEN_REG(PWM1,1)
#define PWM1_SM1DMAEN                            PWM_DMAEN_REG(PWM1,1)
#define PWM1_SM1TCTRL                            PWM_TCTRL_REG(PWM1,1)
#define PWM1_SM1DISMAP0                          PWM_DISMAP_REG(PWM1,1,0)
#define PWM1_SM1DTCNT0                           PWM_DTCNT0_REG(PWM1,1)
#define PWM1_SM1DTCNT1                           PWM_DTCNT1_REG(PWM1,1)
#define PWM1_SM1CAPTCTRLA                        PWM_CAPTCTRLA_REG(PWM1,1)
#define PWM1_SM1CAPTCOMPA                        PWM_CAPTCOMPA_REG(PWM1,1)
#define PWM1_SM1CAPTCTRLB                        PWM_CAPTCTRLB_REG(PWM1,1)
#define PWM1_SM1CAPTCOMPB                        PWM_CAPTCOMPB_REG(PWM1,1)
#define PWM1_SM1CAPTCTRLX                        PWM_CAPTCTRLX_REG(PWM1,1)
#define PWM1_SM1CAPTCOMPX                        PWM_CAPTCOMPX_REG(PWM1,1)
#define PWM1_SM1CVAL0                            PWM_CVAL0_REG(PWM1,1)
#define PWM1_SM1CVAL0CYC                         PWM_CVAL0CYC_REG(PWM1,1)
#define PWM1_SM1CVAL1                            PWM_CVAL1_REG(PWM1,1)
#define PWM1_SM1CVAL1CYC                         PWM_CVAL1CYC_REG(PWM1,1)
#define PWM1_SM1CVAL2                            PWM_CVAL2_REG(PWM1,1)
#define PWM1_SM1CVAL2CYC                         PWM_CVAL2CYC_REG(PWM1,1)
#define PWM1_SM1CVAL3                            PWM_CVAL3_REG(PWM1,1)
#define PWM1_SM1CVAL3CYC                         PWM_CVAL3CYC_REG(PWM1,1)
#define PWM1_SM1CVAL4                            PWM_CVAL4_REG(PWM1,1)
#define PWM1_SM1CVAL4CYC                         PWM_CVAL4CYC_REG(PWM1,1)
#define PWM1_SM1CVAL5                            PWM_CVAL5_REG(PWM1,1)
#define PWM1_SM1CVAL5CYC                         PWM_CVAL5CYC_REG(PWM1,1)
#define PWM1_SM2CNT                              PWM_CNT_REG(PWM1,2)
#define PWM1_SM2INIT                             PWM_INIT_REG(PWM1,2)
#define PWM1_SM2CTRL2                            PWM_CTRL2_REG(PWM1,2)
#define PWM1_SM2CTRL                             PWM_CTRL_REG(PWM1,2)
#define PWM1_SM2VAL0                             PWM_VAL0_REG(PWM1,2)
#define PWM1_SM2FRACVAL1                         PWM_FRACVAL1_REG(PWM1,2)
#define PWM1_SM2VAL1                             PWM_VAL1_REG(PWM1,2)
#define PWM1_SM2FRACVAL2                         PWM_FRACVAL2_REG(PWM1,2)
#define PWM1_SM2VAL2                             PWM_VAL2_REG(PWM1,2)
#define PWM1_SM2FRACVAL3                         PWM_FRACVAL3_REG(PWM1,2)
#define PWM1_SM2VAL3                             PWM_VAL3_REG(PWM1,2)
#define PWM1_SM2FRACVAL4                         PWM_FRACVAL4_REG(PWM1,2)
